Per [@julienduchesne's comment](https://github.com/grafana/terraform-provider-grafana/pull/217#discussion_r653437169), I've added a StateUpgrader to make a smooth transition from slug to UID.

<details>
<summary>I used the following configuration to test this:</summary>

```hcl
terraform {
  required_providers {
    grafana = {
      source = "grafana/grafana"
    }
  }
}

provider "grafana" {
  url  = "http://localhost:3001"
  auth = "admin:admin"
}

resource "grafana_dashboard" "defines_uid" {
  config_json = <<EOD
{
  "title": "Defines UID",
  "uid": "defined-uid"
}
EOD
}

resource "grafana_dashboard" "no_uid" {
  config_json = <<EOD
{
  "title": "No UID"
}
EOD
}

resource "grafana_dashboard" "defines_slug" {
  config_json = <<EOD
{
  "title": "Defines Slug",
  "slug": "defined-slug"
}
EOD
}

resource "grafana_dashboard" "defines_slug_and_uid" {
  config_json = <<EOD
{
  "title": "Defines Slug and UID",
  "slug": "defined-slug",
  "uid": "defined-uid-in-addition-to-slug"
}
EOD
}
```

</details>

I first applied this configuration using the 1.11.0.

<details>
<summary>Execution plan output without the StateUpgrader produced:</summary>

```
grafana_dashboard.defines_slug_and_uid: Refreshing state... [id=defines-slug-and-uid]
grafana_dashboard.defines_uid: Refreshing state... [id=defines-uid]
grafana_dashboard.defines_slug: Refreshing state... [id=defines-slug]
grafana_dashboard.no_uid: Refreshing state... [id=no-uid]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # grafana_dashboard.no_uid has been deleted
  - resource "grafana_dashboard" "no_uid" {
      - config_json  = jsonencode(
            {
              - title = "No UID"
            }
        ) -> null
      - dashboard_id = 1 -> null
      - folder       = 0 -> null
      - id           = "no-uid" -> null
      - slug         = "no-uid" -> null
    }
  # grafana_dashboard.defines_slug has been deleted
  - resource "grafana_dashboard" "defines_slug" {
      - config_json  = jsonencode(
            {
              - slug  = "defined-slug"
              - title = "Defines Slug"
            }
        ) -> null
      - dashboard_id = 4 -> null
      - folder       = 0 -> null
      - id           = "defines-slug" -> null
      - slug         = "defines-slug" -> null
    }
  # grafana_dashboard.defines_slug_and_uid has been deleted
  - resource "grafana_dashboard" "defines_slug_and_uid" {
      - config_json  = jsonencode(
            {
              - slug  = "defined-slug"
              - title = "Defines Slug and UID"
            }
        ) -> null
      - dashboard_id = 2 -> null
      - folder       = 0 -> null
      - id           = "defines-slug-and-uid" -> null
      - slug         = "defines-slug-and-uid" -> null
    }
  # grafana_dashboard.defines_uid has been deleted
  - resource "grafana_dashboard" "defines_uid" {
      - config_json  = jsonencode(
            {
              - title = "Defines UID"
            }
        ) -> null
      - dashboard_id = 3 -> null
      - folder       = 0 -> null
      - id           = "defines-uid" -> null
      - slug         = "defines-uid" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to
undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_dashboard.defines_slug will be created
  + resource "grafana_dashboard" "defines_slug" {
      + config_json  = jsonencode(
            {
              + slug  = "defined-slug"
              + title = "Defines Slug"
            }
        )
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.defines_slug_and_uid will be created
  + resource "grafana_dashboard" "defines_slug_and_uid" {
      + config_json  = jsonencode(
            {
              + slug  = "defined-slug"
              + title = "Defines Slug and UID"
              + uid   = "defined-uid-in-addition-to-slug"
            }
        )
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.defines_uid will be created
  + resource "grafana_dashboard" "defines_uid" {
      + config_json  = jsonencode(
            {
              + title = "Defines UID"
              + uid   = "defined-uid"
            }
        )
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.no_uid will be created
  + resource "grafana_dashboard" "no_uid" {
      + config_json  = jsonencode(
            {
              + title = "No UID"
            }
        )
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + version      = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Warning: Dashboard "defines-uid" is in state, but no longer exists in grafana
│
│   with grafana_dashboard.defines_uid,
│   on main.tf line 14, in resource "grafana_dashboard" "defines_uid":
│   14: resource "grafana_dashboard" "defines_uid" {
│
│ "defines-uid" will be recreated when you apply
╵
╷
│ Warning: Dashboard "no-uid" is in state, but no longer exists in grafana
│
│   with grafana_dashboard.no_uid,
│   on main.tf line 23, in resource "grafana_dashboard" "no_uid":
│   23: resource "grafana_dashboard" "no_uid" {
│
│ "no-uid" will be recreated when you apply
╵
╷
│ Warning: Dashboard "defines-slug" is in state, but no longer exists in grafana
│
│   with grafana_dashboard.defines_slug,
│   on main.tf line 31, in resource "grafana_dashboard" "defines_slug":
│   31: resource "grafana_dashboard" "defines_slug" {
│
│ "defines-slug" will be recreated when you apply
╵
╷
│ Warning: Dashboard "defines-slug-and-uid" is in state, but no longer exists in grafana
│
│   with grafana_dashboard.defines_slug_and_uid,
│   on main.tf line 40, in resource "grafana_dashboard" "defines_slug_and_uid":
│   40: resource "grafana_dashboard" "defines_slug_and_uid" {
│
│ "defines-slug-and-uid" will be recreated when you apply
╵

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
```

</details>

The execution plan with the StateUpgrader shows no changes.